tutorials/Example_Applications/Fracture/fracture_Drainage/0/alpha.wetting
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.wetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
571990
(
0.90
0.90
0.90
0.90
0.90
0.90
0.90
0.90
...
)
;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    leftFace
    {
        type            fixedValue;
	value		uniform 0;
    }
    leftPorous
    {
        type            zeroGradient; 
    }
    rightFace
    {
        type            zeroGradient;
    }
    rightPorous
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
